app/controllers/game_controller.rb

SELECT * FROM `players`
SELECT * FROM `players` WHERE (`players`.`id` = 2)
---
  def new
    @players = Player.all

    if request.post?
      errors        = []
      game          = Game.new
      players       = []
      player_games  = []

      4.times do |i|
        players[i]      = Player.find(params[:game]["player_#{i+1}_id"])

INSERT INTO `games` (`team_b_score`, `updated_at`, `notes`, `team_a_score`, `created_at`) VALUES(10, '2009-09-24 18:55:28', 'Fourth consecutive win for Krish and Dan over Eric and Tim.', 9, '2009-09-24 18:55:28')
---
      game.team_b_score = params[:team_b_score]
      game.notes        = params[:notes]

      if game.save

UPDATE `players` SET `rating` = 5016, `updated_at` = '2009-09-24 20:41:54', `w` = 1 WHERE `id` = 1
---
          if i < 2
            player_games[i].team        = 'a'
            player_games[i].rating_out  = players[i].rating + team_a_change.to_i
            players[i].update_attributes(:rating => player_games[i].rating_out, :w => (team_a_result == 1) ? (players[i].w + 1) : (players[i].w) , :l => (team_a_result == 0) ? (players[i].l + 1) : (players[i].l) )

INSERT INTO `player_games` (`rating_out`, `updated_at`, `player_id`, `team`, `rating_in`, `game_id`, `created_at`) VALUES(NULL, '2009-09-24 18:56:19', 1, NULL, NULL, 2, '2009-09-24 18:56:19')
---
            players[i].update_attributes(:rating => player_games[i].rating_out, :w => (team_b_result == 1) ? (players[i].w + 1) : (players[i].w) , :l => (team_b_result == 0) ? (players[i].l + 1) : (players[i].l) )
          end

          unless player_games[i].save

SELECT * FROM `games` WHERE (`games`.`id` = '--- :id\n')
---
  def show
    @game  = Game.find(params[:id])