app/controllers/home_controller.rb

  def index
    @players      = Player.all
---
SELECT * FROM `players` ORDER BY rating desc