app/controllers/player_controller.rb

  def new
    if request.post?
      p = Player.new(params[:player])

      if p.save
---
INSERT INTO `players` (`rating`, `w`, `l`, `updated_at`, `nick_name`, `first_name`, `last_name`, `created_at`) VALUES(5000, 0, 0, '2009-09-24 17:32:30', '', 'Eric', 'Heidelmark', '2009-09-24 17:32:30')